## Use of pandas library in python to understand and extract relevant information from sales data.

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv("sales_data.csv")

### 1) First of all, we will focus on understanding the general patterns in the data.

In [4]:
data.columns

Index(['Date', 'Day', 'Month', 'Year', 'Customer_Age', 'Age_Group',
       'Customer_Gender', 'Country', 'State', 'Product_Category',
       'Sub_Category', 'Product', 'Order_Quantity', 'Unit_Cost', 'Unit_Price',
       'Profit', 'Cost', 'Revenue'],
      dtype='object')

In [5]:
data.shape

(113036, 18)

In [6]:
data.head()

,Date,Day,Month,Year,Customer_Age,Age_Group,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
0,2013-11-26,26,November,2013,19,Youth (<25),M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8,45,120,590,360,950
1,2015-11-26,26,November,2015,19,Youth (<25),M,Canada,British Columbia,Accessories,Bike Racks,Hitch Rack - 4-Bike,8,45,120,590,360,950
2,2014-03-23,23,March,2014,49,Adults (35-64),M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,23,45,120,1366,1035,2401
3,2016-03-23,23,March,2016,49,Adults (35-64),M,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,20,45,120,1188,900,2088
4,2014-05-15,15,May,2014,47,Adults (35-64),F,Australia,New South Wales,Accessories,Bike Racks,Hitch Rack - 4-Bike,4,45,120,238,180,418

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 113036 entries, 0 to 113035
Data columns (total 18 columns):
Date                113036 non-null object
Day                 113036 non-null int64
Month               113036 non-null object
Year                113036 non-null int64
Customer_Age        113036 non-null int64
Age_Group           113036 non-null object
Customer_Gender     113036 non-null object
Country             113036 non-null object
State               113036 non-null object
Product_Category    113036 non-null object
Sub_Category        113036 non-null object
Product             113036 non-null object
Order_Quantity      113036 non-null int64
Unit_Cost           113036 non-null int64
Unit_Price          113036 non-null int64
Profit              113036 non-null int64
Cost                113036 non-null int64
Revenue             113036 non-null int64
dtypes: int64(9), object(9)
memory usage: 15.5+ MB

In [8]:
data.describe()

,Day,Year,Customer_Age,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
count,113036.000000,113036.000000,113036.000000,113036.000000,113036.000000,113036.000000,113036.000000,113036.000000,113036.000000
mean,15.665753,2014.401739,35.919212,11.901660,267.296366,452.938427,285.051665,469.318695,754.370360
std,8.781567,1.272510,11.021936,9.561857,549.835483,922.071219,453.887443,884.866118,1309.094674
min,1.000000,2011.000000,17.000000,1.000000,1.000000,2.000000,-30.000000,1.000000,2.000000
25%,8.000000,2013.000000,28.000000,2.000000,2.000000,5.000000,29.000000,28.000000,63.000000
50%,16.000000,2014.000000,35.000000,10.000000,9.000000,24.000000,101.000000,108.000000,223.000000
75%,23.000000,2016.000000,43.000000,20.000000,42.000000,70.000000,358.000000,432.000000,800.000000
max,31.000000,2016.000000,87.000000,32.000000,2171.000000,3578.000000,15096.000000,42978.000000,58074.000000

### 2) Learning about the customers demographics specifically age and location.
To keep the notebook concise, we will only desplay few lines lines from the output

In [9]:
# Which countries?
data["Country"].sort_values().unique()

array(['Australia', 'Canada', 'France', 'Germany', 'United Kingdom',
       'United States'], dtype=object)

In [10]:
#Number of Countries
data["Country"].sort_values().unique().shape

(6,)

In [11]:
# Which states?
data["State"].sort_values().unique()

array(['Alabama', 'Alberta', 'Arizona', 'Bayern', 'Brandenburg',
       'British Columbia', 'California', 'Charente-Maritime', 'England',
       'Essonne', 'Florida', 'Garonne (Haute)', 'Georgia', 'Hamburg',
       'Hauts de Seine', 'Hessen', 'Illinois', 'Kentucky', 'Loir et Cher',
       'Loiret', 'Massachusetts', 'Minnesota', 'Mississippi', 'Missouri',
       'Montana', 'Moselle', 'New South Wales', 'New York', 'Nord',
       'Nordrhein-Westfalen', 'North Carolina', 'Ohio', 'Ontario',
       'Oregon', 'Pas de Calais', 'Queensland', 'Saarland',
       'Seine (Paris)', 'Seine Saint Denis', 'Seine et Marne', 'Somme',
       'South Australia', 'South Carolina', 'Tasmania', 'Texas', 'Utah',
       "Val d'Oise", 'Val de Marne', 'Victoria', 'Virginia', 'Washington',
       'Wyoming', 'Yveline'], dtype=object)

In [12]:
# Number of unique states
data["State"].sort_values().unique().shape

(53,)

In [13]:
# Mean age of customers from each state
data.groupby(["State"])["Customer_Age"].mean().head()

State
Alabama        40.000000
Alberta        39.928571
Arizona        28.000000
Bayern         33.973352
Brandenburg    35.898990
Name: Customer_Age, dtype: float64

In [14]:
# Learning about customers age range 
data.groupby(["State"])["Customer_Age"].describe().head()

              count       mean        std   min   25%   50%   75%   max
State
Alabama         4.0  40.000000   0.000000  40.0  40.0  40.0  40.0  40.0
Alberta        56.0  39.928571  15.298077  19.0  24.0  39.0  54.0  62.0
Arizona         4.0  28.000000   4.618802  24.0  24.0  28.0  32.0  32.0
Bayern       1426.0  33.973352   9.808875  17.0  27.0  32.0  41.0  64.0
Brandenburg   198.0  35.898990   9.844986  17.0  28.0  35.0  39.0  56.0

In [38]:
# We can do the following if we are specifically interested in "count", "min", "mean" and "max".
data[["State", "Customer_Age"]].groupby(["State"]).agg(["count", "min", "mean", "max"]).head()

            Customer_Age
                   count min       mean max
State
Alabama                4  40  40.000000  40
Alberta               56  19  39.928571  62
Arizona                4  24  28.000000  32
Bayern              1426  17  33.973352  64
Brandenburg          198  17  35.898990  56

In [29]:
# We can also extract the information for each columns as shown below
data.groupby(["State"])["State"].count().tail()

State
Victoria       6016
Virginia          4
Washington    11264
Wyoming           8
Yveline         954
Name: State, dtype: int64

In [31]:
data.groupby(["State"])["State", "Order_Quantity", "Unit_Cost", "Profit", "Cost", "Revenue"].sum().head()

             Order_Quantity  Unit_Cost  Profit    Cost  Revenue
State
Alabama                 105          4     105     105      210
Alberta                 587      17510   23350   33453    56803
Arizona                   7       2556    4279    5100     9379
Bayern                15617     456006  576691  765294  1341985
Brandenburg            2287      63276   71352   98418   169770

In [16]:
data.groupby(["State"])["Customer_Age"].max().head()

State
Alabama        40
Alberta        62
Arizona        32
Bayern         64
Brandenburg    56
Name: Customer_Age, dtype: int64

In [17]:
data.groupby(["State"])["Unit_Price"].mean().tail()

State
Victoria       617.657912
Virginia        20.000000
Washington     395.589844
Wyoming       1485.500000
Yveline        528.781971
Name: Unit_Price, dtype: float64

In [18]:
data.groupby(["State"])["Unit_Price"].mean().tail()

State
Victoria       617.657912
Virginia        20.000000
Washington     395.589844
Wyoming       1485.500000
Yveline        528.781971
Name: Unit_Price, dtype: float64